night_out_api/app/controllers/api/v1/comments_controller.rb

INSERT INTO "api_v1_comments" ("title", "comments", "rating", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "no"], ["comments", "yes        "], ["rating", 1], ["restaurant_id", 7], ["created_at", "2020-12-08 21:55:23.701310"], ["updated_at", "2020-12-08 21:55:23.701310"]]
---
    def create
        @comment = Api::V1::Comment.create(comment_params)